## Aula de Spark

In [5]:
spark

# Lendo arquivos

#### RDD

In [6]:
rdd = sc.textFile('/bases/hadoop.txt')

In [7]:
rdd.count()

291

In [9]:
rdd.take(1)

['Apache Hadoop ( /həˈduːp/) is a collection of open-source software utilities that facilitate using a network of many computers to solve problems involving massive amounts of data and computation. It provides a software framework for distributed storage and processing of big data using the MapReduce programming model. Originally designed for computer clusters built from commodity hardware[3]—still the common use—it has also found use on clusters of higher-end hardware.[4][5] All the modules in Hadoop are designed with a fundamental assumption that hardware failures are common occurrences and should be automatically handled by the framework.[2]']

In [10]:
rdd2 = sc.textFile('/bases/message.txt')

In [11]:
rdd2.take(6)

['Bem Vindo ao curso de Fast Data com Spark',
 'Este curso foi feito para iniciantes que desejam trabalhar com Fast Data',
 'Todos exercios sao feitos de forma simples e focada na teoria',
 'Inicialemnte teremos exemplos que focan no nucleo',
 'e posteriomente focamos na principais funcoes de mapper e reducer',
 'Espero que todos gostem do curso e ate proximo.']

In [14]:
rdd2.take(1)

['Bem Vindo ao curso de Fast Data com Spark']

#### DataFrame

##### CSV

In [21]:
df_csv = spark.read.csv(path='/bases/base.csv',header=True)

In [22]:
df_csv.show()

+-------+----+---------+
|usuario|item|avaliacao|
+-------+----+---------+
|    109|   9|        3|
|    174| 412|        1|
|      7| 208|        5|
|    371|  97|        5|
|    296| 255|        2|
|    280|  82|        2|
|    271| 275|        4|
|    110| 791|        2|
|     59| 926|        1|
|    217| 576|        1|
|    145| 665|        5|
|    334| 204|        4|
|     42| 568|        4|
|    200| 143|        5|
|     89| 387|        5|
|    311| 588|        4|
|    235| 269|        4|
|    287| 156|        5|
|    344| 204|        4|
|     43| 289|        4|
+-------+----+---------+
only showing top 20 rows

##### JSON

In [154]:
df_json = spark.read.json('/bases/pessoas.json')

In [26]:
df_json.show()

+---+---+-------------+
|age| id|         name|
+---+---+-------------+
| 28|  1|       Helena|
| 44|  2|       Miguel|
| 97|  3|        Alice|
| 28|  4|        Laura|
| 94|  5|      Manuela|
| 71|  6|    Valentina|
| 48|  7|       Sophia|
| 98|  8|     Isabella|
| 60|  9|      Heloísa|
| 46| 10|        Luiza|
| 47| 11|        Júlia|
| 35| 12|       Lorena|
| 32| 13|        Lívia|
| 90| 14|  Maria Luiza|
| 88| 15|      Cecília|
| 36| 16|         Eloá|
| 57| 17|     Giovanna|
| 75| 18|  Maria Clara|
| 97| 19|Maria Eduarda|
| 65| 20|      Mariana|
+---+---+-------------+
only showing top 20 rows

In [27]:
type(df_csv)

pyspark.sql.dataframe.DataFrame

In [28]:
type(df_json)

pyspark.sql.dataframe.DataFrame

In [31]:
help(df_json.filter)

Help on method filter in module pyspark.sql.dataframe:

filter(condition) method of pyspark.sql.dataframe.DataFrame instance
    Filters rows using the given condition.

    :func:`where` is an alias for :func:`filter`.

    :param condition: a :class:`Column` of :class:`types.BooleanType`
        or a string of SQL expression.

    >>> df.filter(df.age > 3).collect()
    [Row(age=5, name='Bob')]
    >>> df.where(df.age == 2).collect()
    [Row(age=2, name='Alice')]

    >>> df.filter("age > 3").collect()
    [Row(age=5, name='Bob')]
    >>> df.where("age = 2").collect()
    [Row(age=2, name='Alice')]

    .. versionadded:: 1.3

In [32]:
import pandas as pd

In [33]:
p = df_json.toPandas()

In [35]:
type(p)

pandas.core.frame.DataFrame

In [36]:
df_json2 = df_json

In [37]:
df_json.show()

+---+---+-------------+
|age| id|         name|
+---+---+-------------+
| 28|  1|       Helena|
| 44|  2|       Miguel|
| 97|  3|        Alice|
| 28|  4|        Laura|
| 94|  5|      Manuela|
| 71|  6|    Valentina|
| 48|  7|       Sophia|
| 98|  8|     Isabella|
| 60|  9|      Heloísa|
| 46| 10|        Luiza|
| 47| 11|        Júlia|
| 35| 12|       Lorena|
| 32| 13|        Lívia|
| 90| 14|  Maria Luiza|
| 88| 15|      Cecília|
| 36| 16|         Eloá|
| 57| 17|     Giovanna|
| 75| 18|  Maria Clara|
| 97| 19|Maria Eduarda|
| 65| 20|      Mariana|
+---+---+-------------+
only showing top 20 rows

In [38]:
df_json2.show()

+---+---+-------------+
|age| id|         name|
+---+---+-------------+
| 28|  1|       Helena|
| 44|  2|       Miguel|
| 97|  3|        Alice|
| 28|  4|        Laura|
| 94|  5|      Manuela|
| 71|  6|    Valentina|
| 48|  7|       Sophia|
| 98|  8|     Isabella|
| 60|  9|      Heloísa|
| 46| 10|        Luiza|
| 47| 11|        Júlia|
| 35| 12|       Lorena|
| 32| 13|        Lívia|
| 90| 14|  Maria Luiza|
| 88| 15|      Cecília|
| 36| 16|         Eloá|
| 57| 17|     Giovanna|
| 75| 18|  Maria Clara|
| 97| 19|Maria Eduarda|
| 65| 20|      Mariana|
+---+---+-------------+
only showing top 20 rows

In [40]:
df_json

DataFrame[age: bigint, id: bigint, name: string]

In [42]:
df_json.describe().show()

+-------+-----------------+------------------+------+
|summary|              age|                id|  name|
+-------+-----------------+------------------+------+
|  count|              100|               100|   100|
|   mean|            52.61|              50.5|  null|
| stddev|29.66373666157508|29.011491975882016|  null|
|    min|                1|                 1|Agatha|
|    max|               98|               100|Yasmin|
+-------+-----------------+------------------+------+

In [47]:
df_maior = df_json.filter(df_json.age >= 18)

In [48]:
df_maior.show()

+---+---+-------------+
|age| id|         name|
+---+---+-------------+
| 28|  1|       Helena|
| 44|  2|       Miguel|
| 97|  3|        Alice|
| 28|  4|        Laura|
| 94|  5|      Manuela|
| 71|  6|    Valentina|
| 48|  7|       Sophia|
| 98|  8|     Isabella|
| 60|  9|      Heloísa|
| 46| 10|        Luiza|
| 47| 11|        Júlia|
| 35| 12|       Lorena|
| 32| 13|        Lívia|
| 90| 14|  Maria Luiza|
| 88| 15|      Cecília|
| 36| 16|         Eloá|
| 57| 17|     Giovanna|
| 75| 18|  Maria Clara|
| 97| 19|Maria Eduarda|
| 65| 20|      Mariana|
+---+---+-------------+
only showing top 20 rows

In [49]:
df_menor = df_json.where(df_json.age < 18)

In [51]:
df_menor.show()

+---+---+------------+
|age| id|        name|
+---+---+------------+
|  4| 26|     Isadora|
|  7| 38|         Liz|
| 12| 39|      Yasmin|
|  3| 48|Maria Helena|
| 13| 50|    Gabriela|
| 17| 53|      Heitor|
|  6| 54|    Bernardo|
| 11| 59|       Pedro|
| 12| 60|    Benjamin|
|  6| 61|     Matheus|
|  6| 69|        Enzo|
|  3| 76|Enzo Gabriel|
|  1| 85|    Leonardo|
| 16| 87|     Eduardo|
|  1| 88|        Gael|
|  1| 89|     Antônio|
|  8| 95|        Cauã|
| 13| 96|  João Lucas|
+---+---+------------+

In [52]:
df_json.count()

100

In [53]:
df_maior.count()

82

In [54]:
df_menor.count()

18

In [55]:
print(82+18)

100

In [57]:
df_union = df_maior.union(df_menor)

In [58]:
df_union.count()

100

In [59]:
df_duplicado = df_union.unionAll(df_json)

In [61]:
df_duplicado.count()

200

In [66]:
df_duplicado.orderBy('id',ascending=True).show()

+---+---+---------+
|age| id|     name|
+---+---+---------+
| 28|  1|   Helena|
| 28|  1|   Helena|
| 44|  2|   Miguel|
| 44|  2|   Miguel|
| 97|  3|    Alice|
| 97|  3|    Alice|
| 28|  4|    Laura|
| 28|  4|    Laura|
| 94|  5|  Manuela|
| 94|  5|  Manuela|
| 71|  6|Valentina|
| 71|  6|Valentina|
| 48|  7|   Sophia|
| 48|  7|   Sophia|
| 98|  8| Isabella|
| 98|  8| Isabella|
| 60|  9|  Heloísa|
| 60|  9|  Heloísa|
| 46| 10|    Luiza|
| 46| 10|    Luiza|
+---+---+---------+
only showing top 20 rows

In [67]:
df_limpo = df_duplicado.dropDuplicates()

In [68]:
df_limpo.orderBy('id',ascending=True).show()

+---+---+-------------+
|age| id|         name|
+---+---+-------------+
| 28|  1|       Helena|
| 44|  2|       Miguel|
| 97|  3|        Alice|
| 28|  4|        Laura|
| 94|  5|      Manuela|
| 71|  6|    Valentina|
| 48|  7|       Sophia|
| 98|  8|     Isabella|
| 60|  9|      Heloísa|
| 46| 10|        Luiza|
| 47| 11|        Júlia|
| 35| 12|       Lorena|
| 32| 13|        Lívia|
| 90| 14|  Maria Luiza|
| 88| 15|      Cecília|
| 36| 16|         Eloá|
| 57| 17|     Giovanna|
| 75| 18|  Maria Clara|
| 97| 19|Maria Eduarda|
| 65| 20|      Mariana|
+---+---+-------------+
only showing top 20 rows

In [72]:
df_name = df_json.select('name','age')

In [79]:
df_json.select('name','age').filter(df_json.age > 72).orderBy('name',ascending=True).show(5)

+---------+---+
|     name|age|
+---------+---+
|   Agatha| 81|
|    Alice| 97|
|Ana Laura| 93|
|Ana Luiza| 92|
|  Anthony| 81|
+---------+---+
only showing top 5 rows

In [80]:
df_json.first()

Row(age=28, id=1, name='Helena')

In [82]:
df_json.limit(5).show()

+---+---+-------+
|age| id|   name|
+---+---+-------+
| 28|  1| Helena|
| 44|  2| Miguel|
| 97|  3|  Alice|
| 28|  4|  Laura|
| 94|  5|Manuela|
+---+---+-------+

In [83]:
df_json.printSchema()

root
 |-- age: long (nullable = true)
 |-- id: long (nullable = true)
 |-- name: string (nullable = true)

In [89]:
df_json.sample(0.1).show()

+---+---+-------+
|age| id|   name|
+---+---+-------+
| 97|  3|  Alice|
| 36| 16|   Eloá|
|  7| 38|    Liz|
| 78| 45|Rafaela|
| 44| 67| Rafael|
| 68| 92|   Caio|
+---+---+-------+

In [115]:
df1 = df_maior.join(df_json,df_maior.id == df_json.id,'right')

In [126]:
df_maior1 = df_maior.withColumn('age1',df_maior.age) \
    .withColumn('id1',df_maior.id) \
    .withColumn('name1',df_maior.name) \
    .drop('age','id','name')

In [129]:
df1 = df_maior1.join(df_json,df_maior1.id1 == df_json.id,'right')

In [130]:
df1.show()

+----+---+-------------+---+---+-------------+
|age1|id1|        name1|age| id|         name|
+----+---+-------------+---+---+-------------+
|  28|  1|       Helena| 28|  1|       Helena|
|  44|  2|       Miguel| 44|  2|       Miguel|
|  97|  3|        Alice| 97|  3|        Alice|
|  28|  4|        Laura| 28|  4|        Laura|
|  94|  5|      Manuela| 94|  5|      Manuela|
|  71|  6|    Valentina| 71|  6|    Valentina|
|  48|  7|       Sophia| 48|  7|       Sophia|
|  98|  8|     Isabella| 98|  8|     Isabella|
|  60|  9|      Heloísa| 60|  9|      Heloísa|
|  46| 10|        Luiza| 46| 10|        Luiza|
|  47| 11|        Júlia| 47| 11|        Júlia|
|  35| 12|       Lorena| 35| 12|       Lorena|
|  32| 13|        Lívia| 32| 13|        Lívia|
|  90| 14|  Maria Luiza| 90| 14|  Maria Luiza|
|  88| 15|      Cecília| 88| 15|      Cecília|
|  36| 16|         Eloá| 36| 16|         Eloá|
|  57| 17|     Giovanna| 57| 17|     Giovanna|
|  75| 18|  Maria Clara| 75| 18|  Maria Clara|
|  97| 19|Maria Eduarda| 97| 19|Maria Eduarda|
|  65| 20|      Mariana| 65| 20|      Mariana|
+----+---+-------------+---+---+-------------+
only showing top 20 rows

In [243]:
df_maior.withColumnRenamed('age','Idade') \
    .withColumnRenamed('id','Chave') \
    .withColumnRenamed('Name','Nome') \
    .show()

+-----+-----+-------------+
|Idade|Chave|         Nome|
+-----+-----+-------------+
|   28|    1|       Helena|
|   44|    2|       Miguel|
|   97|    3|        Alice|
|   28|    4|        Laura|
|   94|    5|      Manuela|
|   71|    6|    Valentina|
|   48|    7|       Sophia|
|   98|    8|     Isabella|
|   60|    9|      Heloísa|
|   46|   10|        Luiza|
|   47|   11|        Júlia|
|   35|   12|       Lorena|
|   32|   13|        Lívia|
|   90|   14|  Maria Luiza|
|   88|   15|      Cecília|
|   36|   16|         Eloá|
|   57|   17|     Giovanna|
|   75|   18|  Maria Clara|
|   97|   19|Maria Eduarda|
|   65|   20|      Mariana|
+-----+-----+-------------+
only showing top 20 rows

In [133]:
df_json.show(5)

+---+---+-------+
|age| id|   name|
+---+---+-------+
| 28|  1| Helena|
| 44|  2| Miguel|
| 97|  3|  Alice|
| 28|  4|  Laura|
| 94|  5|Manuela|
+---+---+-------+
only showing top 5 rows

In [146]:
df_json.filter(df_json.name.like('A%')).show()

+---+---+---------+
|age| id|     name|
+---+---+---------+
| 97|  3|    Alice|
| 91| 23|Antonella|
| 55| 27|Ana Clara|
| 92| 29|Ana Luiza|
| 23| 30|Ana Júlia|
| 25| 41|   Alícia|
| 93| 47|Ana Laura|
| 81| 49|   Agatha|
| 67| 52|   Arthur|
| 81| 81|  Anthony|
|  1| 89|  Antônio|
+---+---+---------+

In [145]:
df_json.filter(df_json.name.startswith("A")).show()

+---+---+---------+
|age| id|     name|
+---+---+---------+
| 97|  3|    Alice|
| 91| 23|Antonella|
| 55| 27|Ana Clara|
| 92| 29|Ana Luiza|
| 23| 30|Ana Júlia|
| 25| 41|   Alícia|
| 93| 47|Ana Laura|
| 81| 49|   Agatha|
| 67| 52|   Arthur|
| 81| 81|  Anthony|
|  1| 89|  Antônio|
+---+---+---------+

In [149]:
df_json.filter(df_json.name.endswith("a")).show()

+---+---+-------------+
|age| id|         name|
+---+---+-------------+
| 28|  1|       Helena|
| 28|  4|        Laura|
| 94|  5|      Manuela|
| 71|  6|    Valentina|
| 48|  7|       Sophia|
| 98|  8|     Isabella|
| 60|  9|      Heloísa|
| 46| 10|        Luiza|
| 47| 11|        Júlia|
| 35| 12|       Lorena|
| 32| 13|        Lívia|
| 90| 14|  Maria Luiza|
| 88| 15|      Cecília|
| 57| 17|     Giovanna|
| 75| 18|  Maria Clara|
| 97| 19|Maria Eduarda|
| 65| 20|      Mariana|
| 89| 21|         Lara|
| 91| 23|    Antonella|
| 77| 24|  Maria Júlia|
+---+---+-------------+
only showing top 20 rows

In [152]:
df_json.filter(df_json.age.between(18,50)).orderBy("age").show()

+---+---+--------------+
|age| id|          name|
+---+---+--------------+
| 23| 30|     Ana Júlia|
| 24| 74|   João Miguel|
| 25| 41|        Alícia|
| 25| 77|Pedro Henrique|
| 26| 90|         Vitor|
| 28|  4|         Laura|
| 28|  1|        Helena|
| 29| 66|      Henrique|
| 30| 55|          Davi|
| 30| 98|        Enrico|
| 32| 71|       Benício|
| 32| 13|         Lívia|
| 32| 56|          Théo|
| 35| 33|         Maitê|
| 35| 12|        Lorena|
| 36| 40|      Isabelly|
| 36| 70|        Murilo|
| 36| 16|          Eloá|
| 44|  2|        Miguel|
| 44| 28|       Melissa|
+---+---+--------------+
only showing top 20 rows

In [155]:
df_json.groupBy("age").count().show()

+---+-----+
|age|count|
+---+-----+
| 29|    1|
| 26|    1|
| 65|    3|
| 77|    1|
|  7|    1|
| 94|    1|
| 57|    2|
| 32|    3|
| 84|    1|
| 98|    1|
| 25|    2|
| 95|    1|
| 71|    1|
|  6|    3|
| 68|    1|
| 51|    2|
| 56|    1|
| 52|    1|
| 17|    1|
| 28|    2|
+---+-----+
only showing top 20 rows

In [156]:
df1.show()

+----+---+-------------+---+---+-------------+
|age1|id1|        name1|age| id|         name|
+----+---+-------------+---+---+-------------+
|  28|  1|       Helena| 28|  1|       Helena|
|  44|  2|       Miguel| 44|  2|       Miguel|
|  97|  3|        Alice| 97|  3|        Alice|
|  28|  4|        Laura| 28|  4|        Laura|
|  94|  5|      Manuela| 94|  5|      Manuela|
|  71|  6|    Valentina| 71|  6|    Valentina|
|  48|  7|       Sophia| 48|  7|       Sophia|
|  98|  8|     Isabella| 98|  8|     Isabella|
|  60|  9|      Heloísa| 60|  9|      Heloísa|
|  46| 10|        Luiza| 46| 10|        Luiza|
|  47| 11|        Júlia| 47| 11|        Júlia|
|  35| 12|       Lorena| 35| 12|       Lorena|
|  32| 13|        Lívia| 32| 13|        Lívia|
|  90| 14|  Maria Luiza| 90| 14|  Maria Luiza|
|  88| 15|      Cecília| 88| 15|      Cecília|
|  36| 16|         Eloá| 36| 16|         Eloá|
|  57| 17|     Giovanna| 57| 17|     Giovanna|
|  75| 18|  Maria Clara| 75| 18|  Maria Clara|
|  97| 19|Maria Eduarda| 97| 19|Maria Eduarda|
|  65| 20|      Mariana| 65| 20|      Mariana|
+----+---+-------------+---+---+-------------+
only showing top 20 rows

In [157]:
df_1 = df_json

In [158]:
df_2 = df_1

In [159]:
df_3 = df_2

In [165]:
df_3.show()

+---+---+-------------+
|age| id|         name|
+---+---+-------------+
| 28|  1|       Helena|
| 44|  2|       Miguel|
| 97|  3|        Alice|
| 28|  4|        Laura|
| 94|  5|      Manuela|
| 71|  6|    Valentina|
| 48|  7|       Sophia|
| 98|  8|     Isabella|
| 60|  9|      Heloísa|
| 46| 10|        Luiza|
| 47| 11|        Júlia|
| 35| 12|       Lorena|
| 32| 13|        Lívia|
| 90| 14|  Maria Luiza|
| 88| 15|      Cecília|
| 36| 16|         Eloá|
| 57| 17|     Giovanna|
| 75| 18|  Maria Clara|
| 97| 19|Maria Eduarda|
| 65| 20|      Mariana|
+---+---+-------------+
only showing top 20 rows

In [175]:
df_3.persist()

DataFrame[age: bigint, id: bigint, name: string]

In [177]:
df_3.show()

+---+---+-------------+
|age| id|         name|
+---+---+-------------+
| 28|  1|       Helena|
| 44|  2|       Miguel|
| 97|  3|        Alice|
| 28|  4|        Laura|
| 94|  5|      Manuela|
| 71|  6|    Valentina|
| 48|  7|       Sophia|
| 98|  8|     Isabella|
| 60|  9|      Heloísa|
| 46| 10|        Luiza|
| 47| 11|        Júlia|
| 35| 12|       Lorena|
| 32| 13|        Lívia|
| 90| 14|  Maria Luiza|
| 88| 15|      Cecília|
| 36| 16|         Eloá|
| 57| 17|     Giovanna|
| 75| 18|  Maria Clara|
| 97| 19|Maria Eduarda|
| 65| 20|      Mariana|
+---+---+-------------+
only showing top 20 rows

In [180]:
df_3.count()

100

In [181]:
df_3.unpersist()

DataFrame[age: bigint, id: bigint, name: string]

In [182]:
df_maior.show()

+---+---+-------------+
|age| id|         name|
+---+---+-------------+
| 28|  1|       Helena|
| 44|  2|       Miguel|
| 97|  3|        Alice|
| 28|  4|        Laura|
| 94|  5|      Manuela|
| 71|  6|    Valentina|
| 48|  7|       Sophia|
| 98|  8|     Isabella|
| 60|  9|      Heloísa|
| 46| 10|        Luiza|
| 47| 11|        Júlia|
| 35| 12|       Lorena|
| 32| 13|        Lívia|
| 90| 14|  Maria Luiza|
| 88| 15|      Cecília|
| 36| 16|         Eloá|
| 57| 17|     Giovanna|
| 75| 18|  Maria Clara|
| 97| 19|Maria Eduarda|
| 65| 20|      Mariana|
+---+---+-------------+
only showing top 20 rows

In [190]:
df_maior.write.csv('/export/csv',header=True,sep=';',mode='append')

In [194]:
df_maior.write.json('/export/json',mode='overwrite')

In [195]:
df_maior.write.parquet('/export/parquet',mode='append')

In [197]:
df_maior.write.orc('/export/orc',mode='append',compression='ZLIB')

In [198]:
df_parquet = spark.read.parquet('/export/parquet')

In [199]:
df_parquet.show()

+---+---+-------------+
|age| id|         name|
+---+---+-------------+
| 28|  1|       Helena|
| 44|  2|       Miguel|
| 97|  3|        Alice|
| 28|  4|        Laura|
| 94|  5|      Manuela|
| 71|  6|    Valentina|
| 48|  7|       Sophia|
| 98|  8|     Isabella|
| 60|  9|      Heloísa|
| 46| 10|        Luiza|
| 47| 11|        Júlia|
| 35| 12|       Lorena|
| 32| 13|        Lívia|
| 90| 14|  Maria Luiza|
| 88| 15|      Cecília|
| 36| 16|         Eloá|
| 57| 17|     Giovanna|
| 75| 18|  Maria Clara|
| 97| 19|Maria Eduarda|
| 65| 20|      Mariana|
+---+---+-------------+
only showing top 20 rows

In [203]:
df_orc = spark.read.orc('/export/orc')

In [201]:
df_orc.show()

+---+---+-------------+
|age| id|         name|
+---+---+-------------+
| 28|  1|       Helena|
| 44|  2|       Miguel|
| 97|  3|        Alice|
| 28|  4|        Laura|
| 94|  5|      Manuela|
| 71|  6|    Valentina|
| 48|  7|       Sophia|
| 98|  8|     Isabella|
| 60|  9|      Heloísa|
| 46| 10|        Luiza|
| 47| 11|        Júlia|
| 35| 12|       Lorena|
| 32| 13|        Lívia|
| 90| 14|  Maria Luiza|
| 88| 15|      Cecília|
| 36| 16|         Eloá|
| 57| 17|     Giovanna|
| 75| 18|  Maria Clara|
| 97| 19|Maria Eduarda|
| 65| 20|      Mariana|
+---+---+-------------+
only showing top 20 rows

In [205]:
df_orc.count()

164

In [206]:
df_parquet.unionAll(df_orc)

DataFrame[age: bigint, id: bigint, name: string]

In [207]:
df_maior.write.orc('/export/orc/1',mode='append',compression='ZLIB')

In [208]:
df_maior.write.orc('/export/orc/2',mode='append',compression='ZLIB')

In [220]:
df_orc = spark.read.orc('/export/orc/*')

In [221]:
df_orc.count()

328

In [223]:
sql('show tables in default').show()

+--------+---------+-----------+
|database|tableName|isTemporary|
+--------+---------+-----------+
+--------+---------+-----------+

In [230]:
df_maior.write.mode('overwrite').format('hive').saveAsTable('default.maior')

In [233]:
df_maior.write.mode('append').insertInto('default.maior')

In [234]:
sql('select * from default.maior').show()

+---+---+-------------+
|age| id|         name|
+---+---+-------------+
| 28|  1|       Helena|
| 44|  2|       Miguel|
| 97|  3|        Alice|
| 28|  4|        Laura|
| 94|  5|      Manuela|
| 71|  6|    Valentina|
| 48|  7|       Sophia|
| 98|  8|     Isabella|
| 60|  9|      Heloísa|
| 46| 10|        Luiza|
| 47| 11|        Júlia|
| 35| 12|       Lorena|
| 32| 13|        Lívia|
| 90| 14|  Maria Luiza|
| 88| 15|      Cecília|
| 36| 16|         Eloá|
| 57| 17|     Giovanna|
| 75| 18|  Maria Clara|
| 97| 19|Maria Eduarda|
| 65| 20|      Mariana|
+---+---+-------------+
only showing top 20 rows

In [235]:
df_hive = sql('select * from default.maior')

In [236]:
df_hive.show()

+---+---+-------------+
|age| id|         name|
+---+---+-------------+
| 28|  1|       Helena|
| 44|  2|       Miguel|
| 97|  3|        Alice|
| 28|  4|        Laura|
| 94|  5|      Manuela|
| 71|  6|    Valentina|
| 48|  7|       Sophia|
| 98|  8|     Isabella|
| 60|  9|      Heloísa|
| 46| 10|        Luiza|
| 47| 11|        Júlia|
| 35| 12|       Lorena|
| 32| 13|        Lívia|
| 90| 14|  Maria Luiza|
| 88| 15|      Cecília|
| 36| 16|         Eloá|
| 57| 17|     Giovanna|
| 75| 18|  Maria Clara|
| 97| 19|Maria Eduarda|
| 65| 20|      Mariana|
+---+---+-------------+
only showing top 20 rows

In [239]:
df_hive_table = spark.read.table('default.maior')

In [240]:
df_hive_table.show()

+---+---+-------------+
|age| id|         name|
+---+---+-------------+
| 28|  1|       Helena|
| 44|  2|       Miguel|
| 97|  3|        Alice|
| 28|  4|        Laura|
| 94|  5|      Manuela|
| 71|  6|    Valentina|
| 48|  7|       Sophia|
| 98|  8|     Isabella|
| 60|  9|      Heloísa|
| 46| 10|        Luiza|
| 47| 11|        Júlia|
| 35| 12|       Lorena|
| 32| 13|        Lívia|
| 90| 14|  Maria Luiza|
| 88| 15|      Cecília|
| 36| 16|         Eloá|
| 57| 17|     Giovanna|
| 75| 18|  Maria Clara|
| 97| 19|Maria Eduarda|
| 65| 20|      Mariana|
+---+---+-------------+
only showing top 20 rows

#### JSON x CSV x Parquet x ORC x Hive

In [242]:
df_json.union(df_csv.union(df_parquet.union(df_orc.union(df_hive)))).show()

+---+---+-------------+
|age| id|         name|
+---+---+-------------+
| 28|  1|       Helena|
| 44|  2|       Miguel|
| 97|  3|        Alice|
| 28|  4|        Laura|
| 94|  5|      Manuela|
| 71|  6|    Valentina|
| 48|  7|       Sophia|
| 98|  8|     Isabella|
| 60|  9|      Heloísa|
| 46| 10|        Luiza|
| 47| 11|        Júlia|
| 35| 12|       Lorena|
| 32| 13|        Lívia|
| 90| 14|  Maria Luiza|
| 88| 15|      Cecília|
| 36| 16|         Eloá|
| 57| 17|     Giovanna|
| 75| 18|  Maria Clara|
| 97| 19|Maria Eduarda|
| 65| 20|      Mariana|
+---+---+-------------+
only showing top 20 rows

In [251]:
df_rename = df_maior.withColumnRenamed('age','Idade') \
    .withColumnRenamed('id','Chave') \
    .withColumnRenamed('Name','Nome')

In [253]:
df_rename.union(df_csv.union(df_parquet.union(df_orc.union(df_hive.union(df_json))))).show()

+-----+-----+-------------+
|Idade|Chave|         Nome|
+-----+-----+-------------+
|   28|    1|       Helena|
|   44|    2|       Miguel|
|   97|    3|        Alice|
|   28|    4|        Laura|
|   94|    5|      Manuela|
|   71|    6|    Valentina|
|   48|    7|       Sophia|
|   98|    8|     Isabella|
|   60|    9|      Heloísa|
|   46|   10|        Luiza|
|   47|   11|        Júlia|
|   35|   12|       Lorena|
|   32|   13|        Lívia|
|   90|   14|  Maria Luiza|
|   88|   15|      Cecília|
|   36|   16|         Eloá|
|   57|   17|     Giovanna|
|   75|   18|  Maria Clara|
|   97|   19|Maria Eduarda|
|   65|   20|      Mariana|
+-----+-----+-------------+
only showing top 20 rows

In [248]:
df_hive

DataFrame[age: bigint, id: bigint, name: string]

In [255]:
df_torto = df_json.select('name','age','id')

In [256]:
df_torto.show()

+-------------+---+---+
|         name|age| id|
+-------------+---+---+
|       Helena| 28|  1|
|       Miguel| 44|  2|
|        Alice| 97|  3|
|        Laura| 28|  4|
|      Manuela| 94|  5|
|    Valentina| 71|  6|
|       Sophia| 48|  7|
|     Isabella| 98|  8|
|      Heloísa| 60|  9|
|        Luiza| 46| 10|
|        Júlia| 47| 11|
|       Lorena| 35| 12|
|        Lívia| 32| 13|
|  Maria Luiza| 90| 14|
|      Cecília| 88| 15|
|         Eloá| 36| 16|
|     Giovanna| 57| 17|
|  Maria Clara| 75| 18|
|Maria Eduarda| 97| 19|
|      Mariana| 65| 20|
+-------------+---+---+
only showing top 20 rows

In [261]:
df_retorn = df_rename.union(df_torto)

In [262]:
df_retorn

DataFrame[Idade: string, Chave: bigint, Nome: string]

In [263]:
df_mysql = spark.read \
    .format("jdbc") \
    .option("url","jdbc:mysql://database/employees") \
    .option("driver","com.mysql.jdbc.Driver") \
    .option("dbtable","employees") \
    .option("user","root") \
    .option("password","secret") \
    .load()

In [265]:
df_mysql.count()

300024

In [266]:
df_mysql.show()

+------+----------+----------+-----------+------+----------+
|emp_no|birth_date|first_name|  last_name|gender| hire_date|
+------+----------+----------+-----------+------+----------+
| 10001|1953-09-02|    Georgi|    Facello|     M|1986-06-26|
| 10002|1964-06-02|   Bezalel|     Simmel|     F|1985-11-21|
| 10003|1959-12-03|     Parto|    Bamford|     M|1986-08-28|
| 10004|1954-05-01| Chirstian|    Koblick|     M|1986-12-01|
| 10005|1955-01-21|   Kyoichi|   Maliniak|     M|1989-09-12|
| 10006|1953-04-20|    Anneke|    Preusig|     F|1989-06-02|
| 10007|1957-05-23|   Tzvetan|  Zielinski|     F|1989-02-10|
| 10008|1958-02-19|    Saniya|   Kalloufi|     M|1994-09-15|
| 10009|1952-04-19|    Sumant|       Peac|     F|1985-02-18|
| 10010|1963-06-01| Duangkaew|   Piveteau|     F|1989-08-24|
| 10011|1953-11-07|      Mary|      Sluis|     F|1990-01-22|
| 10012|1960-10-04|  Patricio|  Bridgland|     M|1992-12-18|
| 10013|1963-06-07| Eberhardt|     Terkki|     M|1985-10-20|
| 10014|1956-02-12|     Berni|      Genin|     M|1987-03-11|
| 10015|1959-08-19|  Guoxiang|  Nooteboom|     M|1987-07-02|
| 10016|1961-05-02|  Kazuhito|Cappelletti|     M|1995-01-27|
| 10017|1958-07-06| Cristinel|  Bouloucos|     F|1993-08-03|
| 10018|1954-06-19|  Kazuhide|       Peha|     F|1987-04-03|
| 10019|1953-01-23|   Lillian|    Haddadi|     M|1999-04-30|
| 10020|1952-12-24|    Mayuko|    Warwick|     M|1991-01-26|
+------+----------+----------+-----------+------+----------+
only showing top 20 rows

In [268]:
df_mysql.write.mode('overwrite').format('hive').saveAsTable('default.employees')

In [269]:
df_mysql2 = df_mysql.filter(df_mysql.emp_no > 10017)

In [271]:
df_mysql2.count()

300007

In [272]:
df_mysql_union = df_mysql2.unionAll(df_mysql)

In [282]:
df_mysql_union.count()

600031

In [278]:
df_mysql_union.cache()

DataFrame[emp_no: int, birth_date: date, first_name: string, last_name: string, gender: string, hire_date: date]

In [283]:
df_mysql_union.show()

+------+----------+----------+----------+------+----------+
|emp_no|birth_date|first_name| last_name|gender| hire_date|
+------+----------+----------+----------+------+----------+
| 10018|1954-06-19|  Kazuhide|      Peha|     F|1987-04-03|
| 10019|1953-01-23|   Lillian|   Haddadi|     M|1999-04-30|
| 10020|1952-12-24|    Mayuko|   Warwick|     M|1991-01-26|
| 10021|1960-02-20|     Ramzi|      Erde|     M|1988-02-10|
| 10022|1952-07-08|    Shahaf|    Famili|     M|1995-08-22|
| 10023|1953-09-29|     Bojan|Montemayor|     F|1989-12-17|
| 10024|1958-09-05|   Suzette|    Pettey|     F|1997-05-19|
| 10025|1958-10-31| Prasadram|    Heyers|     M|1987-08-17|
| 10026|1953-04-03|  Yongqiao|  Berztiss|     M|1995-03-20|
| 10027|1962-07-10|    Divier|   Reistad|     F|1989-07-07|
| 10028|1963-11-26|  Domenick|  Tempesti|     M|1991-10-22|
| 10029|1956-12-13|     Otmar|    Herbst|     M|1985-11-20|
| 10030|1958-07-14|     Elvis|   Demeyer|     M|1994-02-17|
| 10031|1959-01-27|   Karsten|    Joslin|     M|1991-09-01|
| 10032|1960-08-09|     Jeong|   Reistad|     F|1990-06-20|
| 10033|1956-11-14|      Arif|     Merlo|     M|1987-03-18|
| 10034|1962-12-29|     Bader|      Swan|     M|1988-09-21|
| 10035|1953-02-08|     Alain| Chappelet|     M|1988-09-05|
| 10036|1959-08-10|Adamantios| Portugali|     M|1992-01-03|
| 10037|1963-07-22|   Pradeep|  Makrucki|     M|1990-12-05|
+------+----------+----------+----------+------+----------+
only showing top 20 rows

In [286]:
df_maior.write.json('file:/mnt/notebooks/json')

In [287]:
df_maior.write.json('hdfs:/mnt/notebooks/json')